&После("ПриСозданииНаСервере")
Процедура like_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)

	Если Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаСписка" Тогда
		like_ДобавитьКомандуОтправкиВIIKO(Форма);
	КонецЕсли;

КонецПроцедуры

Процедура like_ДобавитьКомандуОтправкиВIIKO(Форма)

	Команда = Форма.Команды.Добавить("like_Send2IIKO");
	Команда.Заголовок = НСтр("ru = 'Отправить в IIKO'; en = 'Send to IIKO'");
	Команда.Действие  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	Команда.Картинка   = БиблиотекаКартинок.Отправить;
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;

	КоманднаяПанель = Форма.Элементы.Найти("СписокДокументыПоступленияКоманднаяПанель");
	Если КоманднаяПанель = Неопределено Тогда
		КоманднаяПанель = Форма.Элементы.Найти("ФормаКоманднаяПанель");
	КонецЕсли;

	Если КоманднаяПанель <> Неопределено Тогда
		Кнопка = Форма.Элементы.Добавить("like_Send2IIKOButton", Тип("КнопкаФормы"), КоманднаяПанель);
		Кнопка.ИмяКоманды = "like_Send2IIKO";
		Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЕсли;

КонецПроцедуры
